2024-07-04-my-german-course.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This post records my impression for my German course"
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>My German course</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="static/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1>
          <a href="https://chenyo-17.github.io/org-static-blog"
            >Chenyo's org-static-blog</a
          >
        </h1>
        <nav>
          <a href="https://chenyo-17.github.io/org-static-blog">Home</a>
          <a href="https://chenyo-17.github.io/org-static-blog/archive.html"
            >Archive</a
          >
          <a href="https://chenyo-17.github.io/org-static-blog/tags.html"
            >Tags</a
          >
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">04 Jul 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-07-04-my-german-course.html"
          >My German course</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li><a href="#orgc038221">1. Was ist passiert</a></li>
            <li>
              <a href="#orgfff412a"
                >2. Ich kann kein gutes Englisch schreiben</a
              >
            </li>
            <li><a href="#org6c3cd2f">3. Ich kann nicht mich vorstellen</a></li>
          </ul>
        </div>
      </nav>
      <div id="outline-container-orgc038221" class="outline-2">
        <h2 id="orgc038221">
          <span class="section-number-2">1.</span> Was ist passiert
        </h2>
        <div class="outline-text-2" id="text-1">
          <p>
            Ich habe seit diesem Montag einen intensiven Deutschkurs gemacht.
            Die Kurs fangt von 8:30 Uhr bis 11:45 Uhr jeden Tag an. Weil von
            mein Wohnung bis zu die Schule ich fast einen Stunden brauche, muss
            ich vor 7 aufstehen und zur Bushaltstelle runnen. Nach dem Kurs
            fahre ich mit dem Bus zur Buro und arbeite ich bis zum Abendessen.
            Danach komme ich nach Haus zuruck und mache ein paar Haushalt. Ich
            gehe circa 11 Uhr ins Bett.
          </p>
        </div>
      </div>
      <div id="outline-container-orgfff412a" class="outline-2">
        <h2 id="orgfff412a">
          <span class="section-number-2">2.</span> Ich kann kein gutes Englisch
          schreiben
        </h2>
        <div class="outline-text-2" id="text-2">
          <p>
            Wenn ich hier diesen Satzen schreibe, merke ich, dass ich komplexe
            Satze auf Englisch nicht mehr schreiben kann.
          </p>

          <p>
            This is interesting, I am still in the starting phase, I cannot
            speak fluently at all and I have grammar mistakes everywhere.
            However, now when I try to type something in english, the german
            translation pops up in my mind first. If I don&rsquo;t know the
            german, I have a problem writing it down in english. As a result, my
            written english falls back to almost the same level as german.
          </p>
        </div>
      </div>
      <div id="outline-container-org6c3cd2f" class="outline-2">
        <h2 id="org6c3cd2f">
          <span class="section-number-2">3.</span> Ich kann nicht mich
          vorstellen
        </h2>
        <div class="outline-text-2" id="text-3">
          <p>
            All my classmates come from diverse backgrounds. At least 5 are
            Ukriainian, and at least 2 from some countries that I have never
            heard before. English is no longer a universal language, but with my
            broken german I can barely chat.
          </p>

          <p>
            Even with english, I have struggled a lot introducing myself. In the
            past decade, I never had this issue since everyone around me shared
            the similar experience. I can easily position myself; which
            education I had, which university I went, what work I am doing, what
            issue I have, etc. But this coordinate system works no more in this
            class. I am only confusing others if I mention I am a PhD student.
            So you are a student, they ask, why would they pay a student?
          </p>

          <p>
            Once I asked classmate what she does on weekend. She paused, and
            said: because you are working, so the weekend is different for you,
            but I don&rsquo;t work, so there is no difference for me. And before
            this I have never thought of such a bias in my question.
          </p>

          <p>
            More and more often recently, I realize how limited my perspective
            is. I did not know what the life with a social worker is like. I did
            not know that Afghan can often speak Turkish. I did not know what my
            lecturer thinks when he works as a security guard at night. I have
            been too much caught up in my own world, such that I am unable to
            ask a meaningful question of people I don&rsquo;t understand. I want
            to know more about the difference of this world, but I don&rsquo;t
            know how.
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-personal.html"
          >personal</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-german.html"
          >german</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
